#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/DevopsFiapSoat3-G35/postech-fase-4-pedido-db/runs/run-HTfCav9wSrjuYBFB

Waiting for the plan to start...

Terraform v1.8.3
on linux_amd64
Initializing plugins and modules...
data.aws_vpc.selected: Refreshing...
data.aws_vpc.selected: Refresh complete after 0s [id=vpc-0ba74380597ac6871]
data.aws_subnet_ids.example: Refreshing...
data.aws_subnet_ids.example: Refresh complete after 0s [id=vpc-0ba74380597ac6871]
data.aws_subnet.example["subnet-021d8ef5485007155"]: Refreshing...
data.aws_subnet.example["subnet-06d5b1f905d7b6ce0"]: Refreshing...
data.aws_subnet.example["subnet-029479b597f0814ec"]: Refreshing...
data.aws_subnet.example["subnet-08de24167ccc5e8d2"]: Refreshing...
data.aws_subnet.example["subnet-03a4e94e7f2c232d8"]: Refreshing...
aws_db_subnet_group.pedido: Refreshing state... [id=pedido]
data.aws_subnet.example["subnet-0cc31bd67dfa8aef7"]: Refreshing...
data.aws_subnet.example["subnet-0cc31bd67dfa8aef7"]: Refresh complete after 0s [id=subnet-0cc31bd67dfa8aef7]
data.aws_subnet.example["subnet-029479b597f0814ec"]: Refresh complete after 0s [id=subnet-029479b597f0814ec]
data.aws_subnet.example["subnet-021d8ef5485007155"]: Refresh complete after 0s [id=subnet-021d8ef5485007155]
data.aws_subnet.example["subnet-08de24167ccc5e8d2"]: Refresh complete after 0s [id=subnet-08de24167ccc5e8d2]
data.aws_subnet.example["subnet-03a4e94e7f2c232d8"]: Refresh complete after 0s [id=subnet-03a4e94e7f2c232d8]
data.aws_subnet.example["subnet-06d5b1f905d7b6ce0"]: Refresh complete after 0s [id=subnet-06d5b1f905d7b6ce0]
aws_db_instance.pedido: Refreshing state... [id=pedido]
aws_db_instance.pedido: Drift detected (update)

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_db_instance.pedido will be updated in-place
  ~ resource "aws_db_instance" "pedido" {
        id                                    = "pedido"
        name                                  = "pedido"
        tags                                  = {
            "Name" = "PedidoPostgresDB"
        }
      ~ vpc_security_group_ids                = [
          - "sg-02277560050bad8f1",
        ] -> (known after apply)
        # (49 unchanged attributes hidden)
    }

  # aws_security_group.instance will be created
  + resource "aws_security_group" "instance" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + from_port        = 5432
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5432
                # (1 unchanged attribute hidden)
            },
        ]
      + name                   = "postgres-security-group"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = "vpc-0ba74380597ac6871"
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @alinedonatoc, Action: `pull_request`*